20260624T230321--all-windows-first-install__first_install_setup_windows.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-07 Tue 18:20 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>All windows first install</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">All windows first install</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb430960">scoop</a>
<ul>
<li><a href="#orgc2e4a17">scoop help</a></li>
<li><a href="#org11e48f9">scoop to install list later</a></li>
</ul>
</li>
<li><a href="#org1785a12">env variables</a></li>
<li><a href="#org07ca511">emacs config</a>
<ul>
<li><a href="#org1020b36">use chemacs2</a></li>
<li><a href="#orgadab0e2"><b>set the following files</b></a>
<ul>
<li><a href="#orgfe00374">~/.emacs-profiles.el</a></li>
<li><a href="#orgdd00d53">~/.emacs.d-vipul/init.el</a></li>
<li><a href="#org554fb4a">~/.emacs.d-vipul/config.org</a></li>
<li><a href="#orgc8c88c4">all contents</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbfa93f0">mpv config</a>
<ul>
<li><a href="#org1a88366">mpv.conf</a></li>
<li><a href="#orgaf5a6ad">input.conf</a></li>
</ul>
</li>
<li><a href="#orgf17661c">sumatra config</a></li>
<li><a href="#org6f66a47">freetube json list</a></li>
<li><a href="#orga97fa3e">git setup</a></li>
<li><a href="#org0c983a3">denote setup</a>
<ul>
<li><a href="#orgbb8d508">nothing special</a></li>
</ul>
</li>
<li><a href="#orgdb9c605">disable start button for windows [this is not working]</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgb430960" class="outline-2">
<h2 id="orgb430960">scoop</h2>
<div class="outline-text-2" id="text-orgb430960">
</div>
<div id="outline-container-orgc2e4a17" class="outline-3">
<h3 id="orgc2e4a17">scoop help</h3>
</div>
<div id="outline-container-org11e48f9" class="outline-3">
<h3 id="org11e48f9">scoop to install list later</h3>
<div class="outline-text-3" id="text-org11e48f9">
<p>
install scoop first
</p>

<div class="org-src-container">
<pre class="src src-powershell">iwr -useb get.scoop.sh | iex
</pre>
</div>

<p>
add extras bucket first
</p>

<div class="org-src-container">
<pre class="src src-powershell">scoop bucket add extras nerd
</pre>
</div>

<div class="org-src-container">
<pre class="src src-powershell">scoop install git curl  mpv musicplayer2 grep findutils xargs freetube ytdlp-interface deno ffmpeg yt-dlp VictorMono-NF album-art-downloader powertoys nomacs googlechrome-canary oh-myposh glazewm zebar emacs
</pre>
</div>

<p>
install and enable aria2 for faster downloades
</p>
<div class="org-src-container">
<pre class="src src-powershell">scoop install aria2 &amp;&amp; scoop config aria2-enabled true
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1785a12" class="outline-2">
<h2 id="org1785a12">env variables</h2>
<div class="outline-text-2" id="text-org1785a12">
<div class="org-src-container">
<pre class="src src-bash">mkdir /User/Lenovo/Vip-emacs
</pre>
</div>

<p>
HOME = C:\Users\&lt;username&gt;\Vip-emacs
set home env variable to /User/Lenovo/Vip-emacs
</p>
</div>
</div>

<div id="outline-container-org07ca511" class="outline-2">
<h2 id="org07ca511">emacs config</h2>
<div class="outline-text-2" id="text-org07ca511">
</div>
<div id="outline-container-org1020b36" class="outline-3">
<h3 id="org1020b36">use chemacs2</h3>
<div class="outline-text-3" id="text-org1020b36">
<p>
clone chemacs2 to ~/.emacs.d
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone https://github.com/plexus/chemacs2.git ~/.emacs.d
</pre>
</div>
</div>
</div>
<div id="outline-container-orgadab0e2" class="outline-3">
<h3 id="orgadab0e2"><b>set the following files</b></h3>
<div class="outline-text-3" id="text-orgadab0e2">
</div>
<div id="outline-container-orgfe00374" class="outline-4">
<h4 id="orgfe00374">~/.emacs-profiles.el</h4>
<div class="outline-text-4" id="text-orgfe00374">
<p>
with
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  ;; ~/.emacs-profiles.el
(("default" . ((user-emacs-directory . "~/.emacs.d-vipul"))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd00d53" class="outline-4">
<h4 id="orgdd00d53">~/.emacs.d-vipul/init.el</h4>
<div class="outline-text-4" id="text-orgdd00d53">
<p>
with
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  ;;; init.el --- Chemacs2 profile init with package.el as default

;; 1. package.el: archives and use-package
(require 'package)

(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("org"   . "https://orgmode.org/elpa/")
        ("elpa"  . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

;; Ensure use-package via package.el (default package manager)
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

;; 2. straight.el bootstrap (available when you explicitly want it)
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el"
                         user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; 3. Org + literate config
(require 'org)

;; Keep this if you want to prevent Emacs from auto-enabling package.el packages
;; and rely on your init/config.org to control loading.
(setq package-enable-at-startup nil)

(org-babel-load-file
 (expand-file-name "config.org" user-emacs-directory))

</pre>
</div>
</div>
</div>
<div id="outline-container-org554fb4a" class="outline-4">
<h4 id="org554fb4a">~/.emacs.d-vipul/config.org</h4>
<div class="outline-text-4" id="text-org554fb4a">
<p>
<a href="20260707T230955--emacs-config-chemac2__chemac2_config_emacs_org.html">emacs config chemac2</a>
</p>
</div>
</div>
<div id="outline-container-orgc8c88c4" class="outline-4">
<h4 id="orgc8c88c4">all contents</h4>
</div>
</div>
</div>
<div id="outline-container-orgbfa93f0" class="outline-2">
<h2 id="orgbfa93f0">mpv config</h2>
<div class="outline-text-2" id="text-orgbfa93f0">
</div>
<div id="outline-container-org1a88366" class="outline-3">
<h3 id="org1a88366">mpv.conf</h3>
<div class="outline-text-3" id="text-org1a88366">
<p>
save-position-on-quit=yes
resume-playback=yes
ytdl-format=bestvideo+bestaudio/best
</p>

<p>
force-window=yes
cursor-autohide=3000
</p>

<p>
ytdl=yes
</p>
</div>
</div>
<div id="outline-container-orgaf5a6ad" class="outline-3">
<h3 id="orgaf5a6ad">input.conf</h3>
<div class="outline-text-3" id="text-orgaf5a6ad">
<p>
h seek -5
l seek 5
j add volume -5
k add volume 5
space cycle pause
q quit
G seek 100 absolute
</p>

<p>
J seek -60
K seek 60
u seek -10
i seek 10
</p>
</div>
</div>
</div>

<div id="outline-container-orgf17661c" class="outline-2">
<h2 id="orgf17661c">sumatra config</h2>
</div>
<div id="outline-container-org6f66a47" class="outline-2">
<h2 id="org6f66a47">freetube json list</h2>
<div class="outline-text-2" id="text-org6f66a47">
<p>
<a href="freetube-subscriptions-2026-07-07.db">freetube-subscriptions-2026-07-07.db</a>
</p>
</div>
</div>
<div id="outline-container-orga97fa3e" class="outline-2">
<h2 id="orga97fa3e">git setup</h2>
</div>
<div id="outline-container-org0c983a3" class="outline-2">
<h2 id="org0c983a3">denote setup</h2>
<div class="outline-text-2" id="text-org0c983a3">
</div>
<div id="outline-container-orgbb8d508" class="outline-3">
<h3 id="orgbb8d508">nothing special</h3>
</div>
</div>
<div id="outline-container-orgdb9c605" class="outline-2">
<h2 id="orgdb9c605">disable start button for windows [this is not working]</h2>
<div class="outline-text-2" id="text-orgdb9c605">
<p>
Yes — in <b><b>Windows directly</b></b>, the usual built-in way is through the <b><b>Registry</b></b> or <b><b>Group Policy</b></b>, not PowerToys. For a permanent system-level disable, the simplest common method is setting `NoWinKeys=1` or using the `Scancode Map` registry entry, then restarting. [winbuzzer](<a href="https://winbuzzer.com/2024/02/09/how-to-disable-the-windows-key-in-windows-11-windows-10-xcxwbt/">https://winbuzzer.com/2024/02/09/how-to-disable-the-windows-key-in-windows-11-windows-10-xcxwbt/</a>)
</p>

<p>
## Option 1: Registry
</p>
<ol class="org-ol">
<li>Press `Win + R`, type `regedit`, and open Registry Editor.</li>
<li>Go to `HKEY<sub>CURRENT</sub><sub>USER\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer</sub>`.</li>
<li>If `Explorer` does not exist, create it.</li>
<li>Create a new <b><b>DWORD (32-bit)</b></b> value named `NoWinKeys`.</li>
<li>Set its value to `1`.</li>
<li>Restart your PC. [techrepublic](<a href="https://www.techrepublic.com/article/how-to-disable-the-windows-key-on-your-keyboard/">https://www.techrepublic.com/article/how-to-disable-the-windows-key-on-your-keyboard/</a>)</li>
</ol>

<p>
## Option 2: Group Policy
If you have Pro/Enterprise, open `gpedit.msc`, then go to `User Configuration &gt; Administrative Templates &gt; Windows Components &gt; File Explorer`, and enable <b><b>Turn off Windows Key hotkeys</b></b>. Then restart. [learn.microsoft](<a href="https://learn.microsoft.com/en-us/answers/questions/3243961/disable-windows-10-keyboard-shortcuts">https://learn.microsoft.com/en-us/answers/questions/3243961/disable-windows-10-keyboard-shortcuts</a>)
</p>

<p>
## Option 3: Scancode map
A deeper system-level method is editing `HKEY<sub>LOCAL</sub><sub>MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard</sub> Layout` and adding a `Scancode Map` binary value to block the Windows keys, then rebooting. [youtube](<a href="https://www.youtube.com/watch?v=XR_RmXtjrRI">https://www.youtube.com/watch?v=XR_RmXtjrRI</a>)
</p>

<p>
## To undo it
</p>
<ul class="org-ul">
<li>Delete `NoWinKeys`, or set it back to `0`.</li>
<li>Or disable the Group Policy setting.</li>
<li>Or delete `Scancode Map` and reboot. [youtube](<a href="https://www.youtube.com/watch?v=XR_RmXtjrRI">https://www.youtube.com/watch?v=XR_RmXtjrRI</a>)</li>
</ul>

<p>
If you want, I can give you the exact registry steps for <b><b>Windows 11 Home</b></b> or <b><b>Windows 11 Pro</b></b>.
</p>
</div>
</div>
</div>
</body>
</html>